app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC
---
  def index
    product = Product.all.order(created_at: :desc)

INSERT INTO "products" ("name", "upc", "available_on", "property_name", "property_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    product= Product.create!(product_params)